Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/String/*/shiyong.resw
Source language: en_us
Languages: de, fr, ja_jp, zh_cn, zh_hant

# textblock30.Text
source: Concept: MD5, message-Algorithm 5 (information-summary algorithm 5), to ensure complete and consistent information transmission. It is one of the most widely used algorithms of computers (and translation summary algorithms, hash algorithms), and MD5 has been widely implemented in mainstream programming languages. The operation of data (such as Chinese characters) as another fixed-length value is the basic principle of the hybrid algorithm, which was preceded by MD2, MD3 and MD4. The MD5 algorithm has the following features:
de: Konzept: MD5, Message-Algorithm 5 (Informations-Zusammenfassungsalgorithmus 5), um eine vollständige und konsistente Informationsübertragung zu gewährleisten. Es ist einer der am häufigsten verwendeten Algorithmen von Computern (und Translation Summary-Algorithmen, Hash-Algorithmen), und MD5 wurde weithin in Mainstream-Programmiersprachen implementiert. Die Funktionsweise von Daten (z. B. chinesische Zeichen) als ein weiterer Wert fester Länge ist das Grundprinzip des Hybridalgorithmus, dem MD2, MD3 und MD4 vorausgingen. Der MD5-Algorithmus verfügt über die folgenden Funktionen:
fr: Concept: MD5, message-Algorithme 5 (algorithme de synthèse d'information 5), pour assurer une transmission complète et cohérente de l'information. C'est l'un des algorithmes les plus largement utilisés des ordinateurs (et des algorithmes de résumé de traduction, algorithmes de hachet), et MD5 a été largement mis en œuvre dans les langages de programmation grand public. Le fonctionnement des données (comme les caractères chinois) comme une autre valeur de longueur fixe est le principe de base de l'algorithme hybride, qui a été précédé par MD2, MD3 et MD4. L'algorithme MD5 a les caractéristiques suivantes :
ja_jp: 概念:MD5、メッセージアルゴリズム5(情報要約アルゴリズム5)、完全かつ一貫性のある情報伝達を確保する。 これは、コンピュータの最も広く使用されているアルゴリズムの一つ(および翻訳要約アルゴリズム、ハッシュアルゴリズム)であり、MD5は、主流のプログラミング言語で広く実装されています。 別の固定長値としてのデータ (漢字など) の操作は、MD2、MD3、および MD4 の前に置かれたハイブリッド アルゴリズムの基本原理です。 MD5 アルゴリズムには、次の機能があります。
zh_cn: 概念：MD5即Message-Digest Algorithm 5（信息-摘要算法5），用于确保信息传输完整一致。是计算机广泛使用的杂凑算法之一（又译摘要算法、哈希算法），主流编程语言普遍已有MD5实现。将数据（如汉字）运算为另一固定长度值，是杂凑算法的基础原理，MD5的前身有MD2、MD3和MD4。MD5算法具有以下特点：
zh_hant: 概念：MD5即Message-Digest Algorithm 5（信息-摘要算法5），用于确保信息传输完整一致。是计算机广泛使用的杂凑算法之一（又译摘要算法、哈希算法），主流编程语言普遍已有MD5实现。将数据（如汉字）运算为另一固定长度值，是杂凑算法的基础原理，MD5的前身有MD2、MD3和MD4。MD5算法具有以下特点：

# textblock31.Text
source: 1. Compression: any length of data, calculated MD5 value length is fixed.
de: 1. Komprimierung: beliebige Datenlänge, berechnete MD5-Wertlänge ist festgelegt.
fr: 1. Compression : toute longueur de données, longueur de valeur MD5 calculée est fixe.
ja_jp: 1. 圧縮: 任意の長さのデータ、計算された MD5 値の長さが固定されます。
zh_cn: 1.压缩性：任意长度的数据，算出的MD5值长度都是固定的。
zh_hant: 1.壓縮性：任意長度的資料，算出的MD5值長度都是固定的。

# textblock32.Text
source: 2. Easy to calculate: It is easy to calculate the MD5 value from the original data.
de: Einfach zu berechnen: Es ist einfach, den MD5-Wert aus den Originaldaten zu berechnen.
fr: 2. Facile à calculer : il est facile de calculer la valeur MD5 à partir des données d'origine.
ja_jp: 2.計算が簡単:元のデータからMD5値を計算するのは簡単です。
zh_cn: 2.容易计算：从原数据计算出MD5值很容易。
zh_hant: 2.容易計算：從原資料計算出MD5值很容易。

# textblock33.Text
source: 3. Anti-modification: any changes to the original data, even if only 1 byte, the resulting MD5 value is very different.
de: 3. Anti-Modifikation: Alle Änderungen an den ursprünglichen Daten, auch wenn nur 1 Byte, der resultierende MD5-Wert ist sehr unterschiedlich.
fr: 3. Anti-modification : toute modification des données d'origine, même si seulement 1 octet, la valeur MD5 résultante est très différente.
ja_jp: 3. アンチ修飾: 元のデータに対する変更は、たとえ 1 バイトであっても、結果として得られる MD5 値が大きく異なります。
zh_cn: 3.抗修改性：对原数据进行任何改动，哪怕只修改1个字节，所得到的MD5值都有很大区别。
zh_hant: 3.抗修改性：對原資料進行任何改動，哪怕只修改1個位元組，所得到的MD5值都有很大區別。

# textblock34.Text
source: 4. Strong collision: Known raw data and its MD5 value, it is very difficult to find a data with the same MD5 value (i.e. falsified data).
de: 4. Starke Kollision: Bekannte Rohdaten und ihr MD5-Wert, es ist sehr schwierig, Daten mit dem gleichen MD5-Wert (d. h. gefälschte Daten) zu finden.
fr: 4. Collision forte : Les données brutes connues et leur valeur MD5, il est très difficile de trouver une donnée ayant la même valeur MD5 (c.-à-d. données falsifiées).
ja_jp: 3. アンチ修飾: 元のデータに対する変更は、たとえ 1 バイトであっても、結果として得られる MD5 値が大きく異なります。 ...
zh_cn: 4.强抗碰撞：已知原数据和其MD5值，想找到一个具有相同MD5值的数据（即伪造数据）是非常困难的。
zh_hant: 4.強抗碰撞：已知原資料和其MD5值，想找到一個具有相同MD5值的資料（即偽造資料）是非常困難的。

# textblock35.Text
source: The role of MD5 is to make large-capacity information compressed into a confidential format (i.e., converting a string of bytes of any length into a certain length of hexadecimal string) hash algorithm skewed it, before signing a private key with digital signature software. Due to the time constraints did not add the sha3 algorithm, here is a sincere apology to express.
de: Die Rolle von MD5 besteht darin, Informationen mit großer Kapazität in ein vertrauliches Format zu komprimiert (d. h. eine Zeichenfolge von Bytes beliebiger Länge in eine bestimmte Länge der hexadezimalen Zeichenfolge zu konvertieren), die ihn verzerrt hat, bevor ein privater Schlüssel mit digitaler Signatursoftware signiert wird. Aufgrund der Zeitbeschränkungen, die den sha3-Algorithmus nicht hinzugefügt haben, ist hier eine aufrichtige Entschuldigung zum Ausdruck zu bringen.
fr: Le rôle de MD5 est de faire des informations de grande capacité compressées dans un format confidentiel (c.-à-d., la conversion d'une chaîne d'octets de n'importe quelle longueur dans une certaine longueur de chaîne hexadecimal) algorithme de hachages biaisé, avant de signer une clé privée avec un logiciel de signature numérique. En raison des contraintes de temps n'a pas ajouté l'algorithme sha3, voici des excuses sincères à exprimer.
ja_jp: MD5 の役割は、大容量の情報を機密形式に圧縮することです (つまり、任意の長さのバイトの文字列を特定の長さのヘキサデシマル文字列に変換する) ハッシュ アルゴリズムは、デジタル署名ソフトウェアで秘密キーに署名する前に、それを歪めました。 時間の制約のためにsha3アルゴリズムを追加しなかったので、ここでは表現する誠実な謝罪です。
zh_cn: MD5的作用是让大容量信息在用数字签名软件签署私人密钥前被 压缩 成一种保密的格式（就是把一个任意长度的字节串变换成一定长的十六进制数字串）哈希算法依次类推。由于时间紧迫没有添加sha3算法，在此表达真挚的歉意.
zh_hant: MD5的作用是讓大容量資訊在用數位簽章軟體簽署私人金鑰前被 壓縮 成一種保密的格式（就是把一個任意長度的位元組串變換成一定長的十六進位數位串）雜湊演算法依次類推。 由於時間緊迫沒有添加sha3演算法，在此表達真摯的歉意.

# textblock36.Text
source: Popular explanation: Many download sites will give the file's sha value, only need to compare the downloaded file's sha value is consistent with the given, you can determine whether the file is damaged during the download process
de: Beliebte Erklärung: Viele Download-Sites geben den Sha-Wert der Datei an, müssen nur den Sha-Wert der heruntergeladenen Datei mit dem angegebenen vergleichen, Sie können feststellen, ob die Datei während des Downloadvorgangs beschädigt ist.
fr: Explication populaire: De nombreux sites de téléchargement donnera la valeur sha du fichier, seulement besoin de comparer la valeur du fichier téléchargé sha est compatible avec le donné, vous pouvez déterminer si le fichier est endommagé pendant le processus de téléchargement
ja_jp: 一般的な説明:多くのダウンロードサイトは、ファイルのsha値を与え、ダウンロードされたファイルのsha値を比較するだけで与えられたものと一致し、ダウンロードプロセス中にファイルが破損しているかどうかを判断することができます
zh_cn: 通俗解释：许多下载站会给出文件的sha值，只需要对比下载到的文件的sha值是否和给出的一致，就可以判断文件是否在下载过程中被损坏
zh_hant: 通俗解釋：許多下載站會給出檔的sha值，只需要對比下載到的檔的sha值是否和給出的一致，就可以判斷檔是否在下載過程中被損壞

# textblock37.Text
source: Comparison files: Temporarily remove this feature due to low usage frequency and time issues
de: Vergleichsdateien: Entfernen Sie diese Funktion vorübergehend aufgrund von geringer Nutzungshäufigkeit und Zeitproblemen
fr: Fichiers de comparaison : supprimez temporairement cette fonctionnalité en raison de la faible fréquence d'utilisation et des problèmes de temps
ja_jp: 比較ファイル: 使用頻度と時間の問題が原因で、この機能を一時的に削除します。
zh_cn: 对比文件：出于过低的使用频率和时间问题，暂时移除这一功能
zh_hant: 對比檔：出於過低的使用頻率和時間問題，暫時移除這一功能

# textblock38.Text
source: About old format files
de: Informationen zu Dateien mit altem Format
fr: À propos des fichiers de format anciens
ja_jp: 关于旧格式文件
zh_cn: 旧格式文件
zh_hant: 關於舊格式檔

# textblock39.Text
source: Due to Microsoft's aggressive update policy and limited effort on the part of the development team, it is no longer possible to compile the 1.3.711 code project or run the 1.3.6 local installation package. But we built 1.3.711 version of the encryption/decryption page in the app How to access it: Help Center - archive
de: Aufgrund der aggressiven Update-Richtlinie von Microsoft und des begrenzten Aufwands seitens des Entwicklungsteams ist es nicht mehr möglich, das Codeprojekt 1.3.711 zu kompilieren oder das lokale Installationspaket 1.3.6 auszuführen. Aber wir haben 1.3.711 Version der Verschlüsselung / Entschlüsselungsseite in der App Wie man darauf zugreift: Help Center - Archiv
fr: En raison de la politique de mise à jour agressive de Microsoft et de l'effort limité de l'équipe de développement, il n'est plus possible de compiler le projet de code 1.3.711 ou d'exécuter le package d'installation locale 1.3.6. Mais nous avons construit 1.3.711 version de la page de cryptage / décryptage dans l'application Comment y accéder: Centre d'aide - archive
ja_jp: マイクロソフトの積極的な更新ポリシーと開発チームの作業が限られているため、1.3.711 コード プロジェクトをコンパイルしたり、1.3.6 ローカル インストール パッケージを実行したりすることはできなくなりました。 しかし、我々はアプリで暗号化/復号化ページの1.3.711バージョンを構築しました: ヘルプセンター - アーカイブ
zh_cn: 由于微软的激进更新政策和开发团队有限的精力，现在已经无法编译1.3.711的代码工程，也无法运行1.3.6的本地安装包。但是我们在应用中内置了1.3.711版本的加密/解密页面 访问方式：帮助中心->存档
zh_hant: 由於微軟的激進更新政策和開發團隊有限的精力，現在已經無法編譯1.3.711的代碼工程，也無法運行1.3.6的本地安裝包。 但是我們在應用中內置了1.3.711版本的加密/解密頁面 訪問方式：説明中心->存檔

# textblock4.Text
source: Random build: It uses the system's random number API to generate a secret key, taking into account subsequent updates we use AA at the beginning
de: Zufälliger Build: Es verwendet die Zufallszahlen-API des Systems, um einen geheimen Schlüssel zu generieren, unter Berücksichtigung nachfolgender Updates verwenden wir AA am Anfang
fr: Construire aléatoire: Il utilise l'API de nombre aléatoire du système pour générer une clé secrète, en tenant compte des mises à jour ultérieures que nous utilisons AA au début
ja_jp: ランダムビルド:システムの乱数APIを使用して秘密キーを生成し、最初にAAを使用する後続の更新を考慮します。
zh_cn: 随机生成：它使用系统的随机数API生成随机密匙，考虑到后续更新我们使用AA开头
zh_hant: 隨機生成：它使用系統的亂數API生成隨機密匙，考慮到後續更新我們使用AA開頭

# textblock40.Text
source: Please convert all encrypted old versions of files into new format files as soon as possible, and we can only maintain support for older files within our capabilities. 1.5.23 version In order to be down-compatible with the operating system, the file encoding was changed from the default code to UTF-8, very few users who could not decrypt the prompt file corruption, please contact the developer for 1.5.21 beta
de: Bitte konvertieren Sie alle verschlüsselten alten Versionen von Dateien so schnell wie möglich in neue Formatdateien, und wir können nur Die Unterstützung für ältere Dateien innerhalb unserer Fähigkeiten beibehalten. 1.5.23 Version Um mit dem Betriebssystem nicht kompatibel zu sein, wurde die Dateicodierung vom Standardcode auf UTF-8 geändert, sehr wenige Benutzer, die die Fehlersuche nicht entschlüsseln konnten, wenden Sie sich bitte an den Entwickler für 1.5.21 Beta
fr: S'il vous plaît convertir toutes les anciennes versions cryptées de fichiers en nouveaux fichiers de format dès que possible, et nous ne pouvons maintenir la prise en charge pour les fichiers plus anciens dans nos capacités. 1.5.23 version Afin d'être down-compatible avec le système d'exploitation, l'encodage de fichier a été changé du code par défaut à UTF-8, très peu d'utilisateurs qui ne pouvaient pas déchiffrer la corruption de fichier rapide, s'il vous plaît contacter le développeur pour 1.5.21 bêta
ja_jp: 暗号化された古いファイルの全てのバージョンをできるだけ早く新しい形式のファイルに変換してください。 1.5.23バージョンオペレーティングシステムとのダウン互換性を持つために、ファイルエンコーディングはデフォルトのコードからUTF-8に変更されましたが、プロンプトファイルの破損を復号化できなかったユーザーはごくわずかですので、1.5.21ベータ版の開発者にお問い合わせください。
zh_cn: 请尽快将所有加密的旧版本的文件转化成新格式的文件,我们只能在能力范围内维持对旧文件的支持。1.5.23版本为了向下兼容操作系统，文件编码由默认编码换成了UTF-8，极个别出现无法解密提示文件损坏的用户，请联系开发者获取1.5.21测试版
zh_hant: 請儘快將所有加密的舊版本的檔轉化成新格式的檔,我們只能在能力範圍內維持對舊檔的支援。 1.5.23版本為了向下相容作業系統，檔編碼由預設編碼換成了UTF-8，極個別出現無法解密提示檔損壞的使用者，請聯繫開發者獲取1.5.21測試版

# textblock41.Text
source: About this app
de: Info zu dieser App
fr: À propos de cette application
ja_jp: このアプリについて
zh_cn: 应用版本
zh_hant: 關於本應用程式

# textblock42.Text
source: The app uses a smooth design system, so users with Windows 10 versions below 14399 receive another installation package 1.3.711, and the versions of the two installation packages no longer match. Due to six large system updates, coupled with the limited capacity of this team, please update to the new version of the system as soon as possible (17763)
de: Die App verwendet ein reibungsloses Designsystem, sodass Benutzer mit Windows 10-Versionen unter 14399 ein weiteres Installationspaket 1.3.711 erhalten und die Versionen der beiden Installationspakete nicht mehr übereinstimmen. Aufgrund von sechs großen System-Updates, gekoppelt mit der begrenzten Kapazität dieses Teams, aktualisieren Sie bitte so schnell wie möglich auf die neue Version des Systems (17763)
fr: L'application utilise un système de conception lisse, de sorte que les utilisateurs avec Windows 10 versions ci-dessous 14399 recevoir un autre paquet d'installation 1.3.711, et les versions des deux paquets d'installation ne correspondent plus. En raison de six grandes mises à jour du système, couplé avec la capacité limitée de cette équipe, s'il vous plaît mettre à jour à la nouvelle version du système dès que possible (17763)
ja_jp: このアプリはスムーズな設計システムを使用しているため、14399 未満の Windows 10 バージョンを持つユーザーは別のインストール パッケージ 1.3.711 を受け取り、2 つのインストール パッケージのバージョンが一致しなくなります。 6 つの大規模なシステム更新プログラムと、このチームの限られた容量を組み合わせて、できるだけ早くシステムの新しいバージョンに更新してください (17763)
zh_cn: 应用使用流畅设计体系，因此Windows 10 版本低于14399的用户会收到另一个安装包1.3.711，这两个安装包的版本不再一致。由于跨越六个大的系统更新，加之本团队能力有限请尽快更新至新版本系统（17763）
zh_hant: 應用使用流暢設計體系，因此Windows 10 版本低於14399的使用者會收到另一個安裝包1.3.711，這兩個安裝包的版本不再一致。 由於跨越六個大的系統更新，加之本團隊能力有限請儘快更新至新版本系統（17763）

# textblock43.Text
source: The current version contains English, Japanese, German, French, traditional Chinese, you can go to the system Settings to switch languages
de: Die aktuelle ausgabe enthält englisch, japanisch, Deutsch, französisch und chinesisch und ist verfügbar, um umgehende sprachen auszuwählen
fr: La version actuelle contient les versions traditionnelles de l’anglais, du japonais, de l’allemand, du français et du chinois
ja_jp: 现在バージョンは英语、日本语、ドイツ语、フランス语、中国语の繁体语が含まれており、システムに切り替え言语が设置されている
zh_cn: 当前版本包含英语，日语，德语，法语，中文繁体，可以前往系统设置切换语言
zh_hant: 當前版本包含英語，日語，德語，法語，中文繁體，可以前往系統設置切換語言

# textblock44.Text
source: For Windows 10 Mobile users, we have now successfully adapted to the Anniversary Update (14399), please upgrade to the latest system
de: Für Windows 10 Mobile-Benutzer haben wir uns jetzt erfolgreich an das Anniversary Update (14399) angepasst, aktualisieren Sie bitte auf das neueste System
fr: Pour Windows 10 utilisateurs mobiles, nous avons maintenant réussi à adapter à la mise à jour anniversaire (14399), s'il vous plaît passer au dernier système
ja_jp: 对于Windows 10 Mobile用户，目前我们已经成功适配到周年更新版本（14399），请升级到最新系统
zh_cn: 对于Windows 10 Mobile用户，目前我们已经成功适配到周年更新版本（14399），请升级到最新系统
zh_hant: 對於Windows 10 Mobile使用者，目前我們已經成功適配到周年更新版本（14399），請升級到最新系統

# textblock45.Text
source: Disclaimer
de: Haftungsausschluss
fr: Clause d'exclusion de responsabilité
ja_jp: 免責事項
zh_cn: 免责声明
zh_hant: 免責聲明

# textblock46.Text
source: We ensure that this application is thoroughly tested, but do not guarantee that the application will function properly at all times, nor that the encryption/decryption results are correct. Please contact us in the first place after any problems occur and we will make repairs and compensation within our capabilities. We do not warrant the accuracy and completeness of the translated text, i.e. we are not responsible for any loss caused by the instructions in English that cause you to misunderstand and cause some damage.
de: Wir stellen sicher, dass diese Anwendung gründlich getestet wird, aber garantieren nicht, dass die Anwendung jederzeit ordnungsgemäß funktioniert, noch dass die Verschlüsselungs-/Entschlüsselungsergebnisse korrekt sind. Bitte kontaktieren Sie uns in erster Linie, nachdem Probleme auftreten und wir werden Reparaturen und Entschädigung im Rahmen unserer Möglichkeiten vornehmen. Wir übernehmen keine Gewätsskraft für die Richtigkeit und Vollständigkeit des übersetzten Textes, d.h. wir sind nicht verantwortlich für Verluste, die durch die Anweisungen in englischer Sprache verursacht werden, die Sie zu Missverstehen und Zufall von Schäden führen.
fr: Nous nous assurons que cette application est testée à fond, mais ne garantissons pas que l'application fonctionnera correctement en tout temps, ni que les résultats de chiffrement/décryptage sont corrects. S'il vous plaît contactez-nous en premier lieu après tout problème se produisent et nous ferons des réparations et des compensations dans nos capacités. Nous ne justifions pas l'exactitude et l'exhaustivité du texte traduit, c'est-à-dire que nous ne sommes pas responsables de toute perte causée par les instructions en anglais qui vous font mal comprendre et causer des dommages.
ja_jp: 私たちは、このアプリケーションが徹底的にテストされていることを保証しますが、アプリケーションが常に正しく機能し、暗号化/復号化の結果が正しいことを保証しません。 問題が発生した後、最初にご連絡ください、私たちは私たちの能力内で修理や補償を行います。 翻訳されたテキストの正確性および完全性を保証するものではありません。
zh_cn: 我们确保对此应用进行了全面测试，但是不担保此应用在任何时候都运行正常，也不担保加密/解密结果的正确性。发生任何问题后请在第一时间联系我们，我们会做出能力范围内的修复和补偿。我们不对翻译的文字的准确性和完整性做出担保，即由于英文的提示说明使你误解并造成了一定损失，我们不承担任何责任
zh_hant: 我們確保對此應用進行了全面測試，但是不擔保此應用在任何時候都運行正常，也不擔保加密/解密結果的正確性。 發生任何問題後請在第一時間聯繫我們，我們會做出能力範圍內的修復和補償。 我們不對翻譯的文字的準確性和完整性做出擔保，即由於英文的提示說明使你誤解並造成了一定損失，我們不承擔任何責任

# textblock5.Text
source: Note: The same encrypted text or file decryption key and encryption key are the same! Keep in mind the key, there is currently no way to retrieve it!
de: Hinweis: Der gleiche verschlüsselte Text oder Datei entschlüsselungsschlüsseln Schlüssel und Verschlüsselungsschlüssel sind die gleichen! Denken Sie daran, den Schlüssel, es gibt derzeit keine Möglichkeit, es abzurufen!
fr: Remarque : La même clé de décryptage de texte ou de fichier cryptée et la même clé de chiffrement sont les mêmes ! Gardez à l'esprit la clé, il n'y a actuellement aucun moyen de le récupérer!
ja_jp: 注: 同じ暗号化されたテキストまたはファイルの復号化キーと暗号化キーは同じです。 キーを念頭に置いて、現在それを取得する方法はありません!
zh_cn: 注意：同一个加密文本或文件的解密密匙和加密密匙是同一个！请牢记密匙，目前没有找回密匙的方法！
zh_hant: 注意：同一個加密文本或檔的解密密匙和加密密匙是同一個！ 請牢記密匙，目前沒有找回密匙的方法！

# textblock6.Text
source: We recommend the default key not for security reasons, but for fear that you will forget the key and lose valuable files!!!
de: Wir empfehlen den Standardschlüssel nicht aus Sicherheitsgründen, sondern aus Angst, dass Sie den Schlüssel vergessen und wertvolle Dateien verlieren!!!
fr: Nous recommandons la clé par défaut non pas pour des raisons de sécurité, mais de peur que vous oubliez la clé et perdre des fichiers précieux!!!
ja_jp: セキュリティ上の理由ではなく、キーを忘れて貴重なファイルを失うことを恐れて、デフォルトのキーをお勧めします!!!
zh_cn: 我们推荐使用默认密匙并不是出于安全的考虑，而是担心你会忘记密匙从而丢失宝贵文件！！！
zh_hant: 我們推薦使用預設密匙並不是出於安全的考慮，而是擔心你會忘記密匙從而丟失寶貴檔！！！

# textblock7.Text
source: Encryption algorithms (symmetric encryption)
de: Verschlüsselungsalgorithmen (symmetrische Verschlüsselung)
fr: Algorithmes de chiffrement (cryptage symétrique)
ja_jp: 暗号化アルゴリズム (対称暗号化)
zh_cn: 加密算法（对称式加密技术）
zh_hant: 加密算法（对称式加密技术）

# textblock8.Text
source: Concept: The basic process of data encryption is to process the original clear-text file or data according to some algorithm, making it unreadable a piece of code, often referred to as redaction, so that it can only be entered after the corresponding key can show the original content, through such a way to protect the data from illegal theft, reading purposes. The reverse process of the process is the process of decrypting, which converts the encoded information into its original data.
de: Konzept: Der grundlegende Prozess der Datenverschlüsselung besteht darin, die ursprüngliche Klartextdatei oder Daten nach einem Algorithmus zu verarbeiten, so dass sie unlesbar ein Code ist, der oft als Redaction bezeichnet wird, so dass er erst eingegeben werden kann, nachdem der entsprechende Schlüssel den originalen Inhalt anzeigen kann, so dass die Daten vor illegalem Diebstahl, Lesezwecken geschützt werden können. Der umgekehrte Prozess des Prozesses ist der Prozess der Entschlüsselung, der die codierten Informationen in seine ursprünglichen Daten konvertiert.
fr: Concept: Le processus de base du cryptage des données est de traiter le fichier ou les données d'origine en texte clair selon un algorithme, ce qui en fait un morceau de code illisible, souvent appelé redaction, de sorte qu'il ne peut être entré qu'après que la clé correspondante peut afficher le contenu original, de manière à protéger les données contre le vol illégal, fins de lecture. Le processus inverse du processus est le processus de décryptage, qui convertit les informations codées en ses données d'origine.
ja_jp: 概念: データ暗号化の基本的なプロセスは、何らかのアルゴリズムに従って元のクリアテキストファイルまたはデータを処理し、コードの一部を読み取り不能にし、対応するキーが元のコンテンツを表示できる後にのみ入力できるようにすることです。 プロセスの逆のプロセスは、エンコードされた情報を元のデータに変換する復号化プロセスです。
zh_cn: 概念：数据加密的基本过程就是对原来为明文的文件或数据按某种算法进行处理，使其成为不可读的一段代码，通常称为 密文 ，使其只能在输入相应的密钥之后才能显示出本来内容，通过这样的途径来达到保护数据不被非法人窃取、阅读的目的。 该过程的逆过程为解密，即将该编码信息转化为其原来数据的过程。
zh_hant: 概念：資料加密的基本過程就是對原來為明文的檔或資料按某種演算法進行處理，使其成為不可讀的一段代碼，通常稱為 密文 ，使其只能在輸入相應的金鑰之後才能顯示出本來內容，通過這樣的途徑來達到保護資料不被非法人竊取、閱讀的目的。 該過程的逆過程為解密，即將該編碼資訊轉化為其原來資料的過程。

# textblock9.Text
source: Popular explanation: It's like putting your file in a drawer and locking it, only with the corresponding key to open it (decrypted), and no one else can open it unless it's violent (try ingestalling all the keys in the world)
de: Beliebte Erklärung: Es ist wie ihre Datei in eine Schublade zu legen und sperren, nur mit dem entsprechenden Schlüssel, um es zu öffnen (entschlüsselt), und niemand sonst kann es öffnen, es sei denn, es ist gewalttätig (versuchen, alle Schlüssel in der Welt zu installieren)
fr: Explication populaire: C'est comme mettre votre fichier dans un tiroir et le verrouiller, seulement avec la clé correspondante pour l'ouvrir (décrypté), et personne d'autre ne peut l'ouvrir à moins qu'il ne soit violent (essayez d'installer toutes les clés dans le monde)
ja_jp: 一般的な説明:それは、ファイルを引き出しに入れてロックするようなものですが、対応するキーでのみ開きます(復号化)、暴力的でない限り他の誰もファイルを開けることができない(世界のすべてのキーを取り込んでみて)。
zh_cn: 通俗解释：这就像把你的文件放进一个抽屉并给它上锁，只有用对应的钥匙才能打开这个抽屉（解密），而其他人无法打开这个抽屉，除非通过暴力手段（尝试遍世界上的所有钥匙）
zh_hant: 通俗解釋：這就像把你的檔放進一個抽屜並給它上鎖，只有用對應的鑰匙才能打開這個抽屜（解密），而其他人無法打開這個抽屜，除非通過暴力手段（嘗試遍世界上的所有鑰匙）

# textblock47.Text
source: About download management
de: Informationen zur Downloadverwaltung
fr: À propos de la gestion des téléchargements
ja_jp: ダウンロード管理について
zh_cn: 关于下载管理
zh_hant: 關於下載管理
